open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
/****************************************************************************
 * chips/bk7258/cp/
 * bk7258_ap_supervisor.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * N10 CP-owned AP liveness supervisor.  It observes three independent level
 * signals: the AP primary management loop, a task pinned to AP logical CPU1,
 * and a generation-safe RPMsg ping/pong endpoint.  It never runs lifecycle
 * work in an ISR or RPMsg callback.  Confirmed faults fail closed by moving
 * the shared RPTUN state to FAULTED; recovery reuses the existing apctl path.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_AP_SUPERVISOR

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_rpmsg_health.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_AP_SUPERVISOR_NAME "bk7258-ap-health"
#define BK7258_AP_TRANSPORT_CP_RX  (1u << 0)
#define BK7258_AP_TRANSPORT_AP_RX  (1u << 1)
#define BK7258_AP_TRANSPORT_BIDIR  (BK7258_AP_TRANSPORT_CP_RX | \
                                    BK7258_AP_TRANSPORT_AP_RX)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_ap_supervisor_s
{
  mutex_t lock;
  bool initialized;
  bool armed;
  bool recovering;
  bool lifecycle;
  bool ready_seen;
  bool invalid_seen;
  bool auto_recover_pending;
  pid_t worker;
  uint32_t last_primary;
  uint32_t last_secondary;
  uint32_t last_cp_rx;
  uint32_t last_ap_rx;
  uint32_t transport_activity;
  clock_t ready_tick;
  clock_t invalid_tick;
  clock_t primary_tick;
  clock_t secondary_tick;
  clock_t transport_tick;
  clock_t last_probe_tick;
  clock_t healthy_tick;
  clock_t sample_tick;
  struct bk7258_ap_supervisor_status_s status;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_ap_supervisor_s g_bk7258_ap_supervisor =
{
  .lock = NXMUTEX_INITIALIZER,
  .worker = INVALID_PROCESS_ID,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static uint32_t bk7258_ap_supervisor_age_ms(clock_t now, clock_t then)
{
  uint64_t age = TICK2MSEC((clock_t)(now - then));

  return age > UINT32_MAX ? UINT32_MAX : (uint32_t)age;
}

static bool bk7258_ap_supervisor_injects(
  const struct bk7258_ap_supervisor_s *priv, uint32_t injection)
{
#ifdef CONFIG_BK7258_AP_SUPERVISOR_FAULT_INJECTION
  return priv->status.injection == injection;
#else
  (void)priv;
  (void)injection;
  return false;
#endif
}

static void bk7258_ap_supervisor_status_initialize(
  struct bk7258_ap_supervisor_s *priv)
{
  memset(&priv->status, 0, sizeof(priv->status));
  priv->status.version = BK7258_AP_SUPERVISOR_STATUS_VERSION;
  priv->status.size = sizeof(priv->status);
  priv->status.state = BK7258_AP_SUPERVISOR_OFFLINE;
#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
  priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_AUTO_RECOVER;
#endif
}

static void bk7258_ap_supervisor_set_offline_locked(
  struct bk7258_ap_supervisor_s *priv, uint32_t generation)
{
  uint32_t saved = priv->status.flags &
                   BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED;

#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
  saved |= BK7258_AP_SUPERVISOR_FLAG_AUTO_RECOVER;
#endif
  priv->armed = false;
  priv->ready_seen = false;
  priv->invalid_seen = false;
  priv->auto_recover_pending = false;
  priv->status.state = BK7258_AP_SUPERVISOR_OFFLINE;
  priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
  priv->status.generation = generation;
  priv->status.flags = saved;
  priv->status.primary_heartbeat = 0;
  priv->status.secondary_heartbeat = 0;
  priv->status.transport_sequence = 0;
  priv->status.primary_age_ms = 0;
  priv->status.secondary_age_ms = 0;
  priv->status.transport_age_ms = 0;
  priv->status.healthy_age_ms = 0;
  priv->status.injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
  priv->status.last_error = 0;
  priv->last_cp_rx = 0;
  priv->last_ap_rx = 0;
  priv->transport_activity = 0;
  priv->healthy_tick = 0;
}

static void bk7258_ap_supervisor_disarm_locked(
  struct bk7258_ap_supervisor_s *priv, uint32_t generation,
  uint32_t state)
{
  uint32_t saved = priv->status.flags &
                   BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED;

#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
  saved |= BK7258_AP_SUPERVISOR_FLAG_AUTO_RECOVER;
#endif
  priv->armed = false;
  priv->ready_seen = false;
  priv->invalid_seen = false;
  priv->status.state = state;
  priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
  priv->status.generation = generation;
  priv->status.flags = saved;
  priv->status.primary_age_ms = 0;
  priv->status.secondary_age_ms = 0;
  priv->status.transport_age_ms = 0;
  priv->status.healthy_age_ms = 0;
  priv->status.injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
  priv->status.last_error = 0;
  priv->last_cp_rx = 0;
  priv->last_ap_rx = 0;
  priv->transport_activity = 0;
  priv->healthy_tick = 0;
}

static void bk7258_ap_supervisor_arm_locked(
  struct bk7258_ap_supervisor_s *priv,
  const struct bk7258_ap_boot_state_s *boot,
  const struct bk7258_cpu2_probe_state_s *cpu2,
  const struct bk7258_rptun_control_s *rptun,
  clock_t now)
{
  uint32_t saved = priv->status.flags &
                   BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED;

#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
  saved |= BK7258_AP_SUPERVISOR_FLAG_AUTO_RECOVER;
#endif
  priv->armed = true;
  priv->invalid_seen = false;
  priv->last_primary = boot->heartbeat;
  priv->last_secondary = cpu2->heartbeat;
  priv->last_cp_rx = rptun->cp_rx_sequence;
  priv->last_ap_rx = rptun->ap_rx_sequence;
  priv->transport_activity = 0;
  priv->primary_tick = now;
  priv->secondary_tick = now;
  priv->transport_tick = now;
  priv->last_probe_tick = now;
  priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
  priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
  priv->status.generation = boot->generation;
  priv->status.flags = saved | BK7258_AP_SUPERVISOR_FLAG_ARMED;
  priv->status.primary_heartbeat = boot->heartbeat;
  priv->status.secondary_heartbeat = cpu2->heartbeat;
  priv->status.transport_sequence = 0;
  priv->status.primary_age_ms = 0;
  priv->status.secondary_age_ms = 0;
  priv->status.transport_age_ms = 0;
  priv->status.healthy_age_ms = 0;
  priv->status.injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
  priv->status.last_error = 0;
  priv->healthy_tick = 0;
}

static bool bk7258_ap_supervisor_transport_activity_locked(
  struct bk7258_ap_supervisor_s *priv,
  volatile struct bk7258_rptun_control_s *rptun, clock_t now)
{
  uint32_t cp_rx;
  uint32_t ap_rx;

  if (rptun->magic != BK7258_RPTUN_CONTROL_MAGIC ||
      rptun->version != BK7258_RPTUN_CONTROL_VERSION ||
      rptun->size != sizeof(*rptun) ||
      rptun->generation != priv->status.generation ||
      rptun->state != BK7258_RPTUN_STATE_CONNECTED)
    {
      return false;
    }

