open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
  cp_rx = __atomic_load_n(
    (uint32_t *)(uintptr_t)&rptun->cp_rx_sequence, __ATOMIC_ACQUIRE);
  ap_rx = __atomic_load_n(
    (uint32_t *)(uintptr_t)&rptun->ap_rx_sequence, __ATOMIC_ACQUIRE);

  if (cp_rx != priv->last_cp_rx)
    {
      priv->last_cp_rx = cp_rx;
      priv->transport_activity |= BK7258_AP_TRANSPORT_CP_RX;
    }

  if (ap_rx != priv->last_ap_rx)
    {
      priv->last_ap_rx = ap_rx;
      priv->transport_activity |= BK7258_AP_TRANSPORT_AP_RX;
    }

  if (priv->transport_activity != BK7258_AP_TRANSPORT_BIDIR ||
      bk7258_ap_supervisor_injects(
        priv, BK7258_AP_SUPERVISOR_INJECT_RPMSG))
    {
      return false;
    }

  /* Bidirectional vring progress is stronger evidence than a concurrent
   * best-effort ping: the peer consumed one direction and returned traffic
   * in the other.  Defer the next active probe while application traffic is
   * already proving the same property.
   */

  priv->transport_activity = 0;
  priv->transport_tick = now;
  priv->last_probe_tick = now;
  priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_RPMSG_READY |
                        BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK;
  priv->status.last_error = 0;
  return true;
}

static void bk7258_ap_supervisor_capture_fault_locked(
  struct bk7258_ap_supervisor_s *priv,
  const struct bk7258_ap_fault_state_s *fault,
  const struct bk7258_cpu2_probe_state_s *cpu2,
  uint32_t generation)
{
  if (fault->magic == BK7258_AP_FAULT_STATE_MAGIC &&
      fault->version == BK7258_AP_FAULT_STATE_VERSION &&
      fault->size == sizeof(*fault) &&
      fault->generation == generation && fault->exception != 0)
    {
      priv->status.fault_generation = generation;
      priv->status.fault_exception = fault->exception;
      priv->status.fault_hfsr = fault->hfsr;
      priv->status.fault_cfsr = fault->cfsr;
      priv->status.fault_pc = fault->stacked_pc;
      priv->status.fault_lr = fault->stacked_lr;
      priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED;
    }
  else if (cpu2->magic == BK7258_CPU2_PROBE_STATE_MAGIC &&
           cpu2->version == BK7258_CPU2_PROBE_STATE_VERSION &&
           cpu2->size == sizeof(*cpu2) &&
           cpu2->generation == generation && cpu2->fault_exception != 0)
    {
      priv->status.fault_generation = generation;
      priv->status.fault_exception = cpu2->fault_exception;
      priv->status.fault_hfsr = cpu2->fault_hfsr;
      priv->status.fault_cfsr = cpu2->fault_cfsr;
      priv->status.fault_pc = cpu2->fault_pc;
      priv->status.fault_lr = cpu2->fault_lr;
      priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_FAULT_SAVED;
    }
}

static void bk7258_ap_supervisor_mark_rptun_fault(
  uint32_t generation, int error)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t expected = BK7258_RPTUN_STATE_CONNECTED;

  if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
      control->version != BK7258_RPTUN_CONTROL_VERSION ||
      control->size != sizeof(*control) ||
      control->generation != generation)
    {
      return;
    }

  if (__atomic_compare_exchange_n(
        (uint32_t *)(uintptr_t)&control->state, &expected,
        BK7258_RPTUN_STATE_FAULTED, false,
        __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
    {
      control->error = error < 0 ? (uint32_t)-error : (uint32_t)error;
      __asm volatile ("dmb sy" ::: "memory");
    }
}

static void bk7258_ap_supervisor_fault_locked(
  struct bk7258_ap_supervisor_s *priv, uint32_t reason, int error,
  const struct bk7258_ap_fault_state_s *fault,
  const struct bk7258_cpu2_probe_state_s *cpu2)
{
  if (priv->status.state == BK7258_AP_SUPERVISOR_FAULTED ||
      priv->status.state == BK7258_AP_SUPERVISOR_LOCKOUT)
    {
      return;
    }

  priv->status.state = BK7258_AP_SUPERVISOR_FAULTED;
  priv->status.reason = reason;
  priv->status.last_error = error;
  priv->status.fault_count++;
  priv->status.consecutive_failures++;
  priv->healthy_tick = 0;
  priv->status.healthy_age_ms = 0;
  bk7258_ap_supervisor_capture_fault_locked(
    priv, fault, cpu2, priv->status.generation);
  bk7258_ap_supervisor_mark_rptun_fault(priv->status.generation, error);

#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
  if (priv->status.consecutive_failures >
      CONFIG_BK7258_AP_SUPERVISOR_MAX_RECOVERIES)
    {
      priv->status.state = BK7258_AP_SUPERVISOR_LOCKOUT;
    }
  else
    {
      priv->auto_recover_pending = true;
    }
#endif
}

static void bk7258_ap_supervisor_evaluate_locked(
  struct bk7258_ap_supervisor_s *priv, clock_t now,
  const struct bk7258_ap_fault_state_s *fault,
  const struct bk7258_cpu2_probe_state_s *cpu2)
{
  uint32_t suspect = CONFIG_BK7258_AP_SUPERVISOR_SUSPECT_MS;
  uint32_t timeout = CONFIG_BK7258_AP_SUPERVISOR_TIMEOUT_MS;
  uint32_t reason = BK7258_AP_SUPERVISOR_REASON_NONE;

  priv->status.primary_age_ms =
    bk7258_ap_supervisor_age_ms(now, priv->primary_tick);
  priv->status.secondary_age_ms =
    bk7258_ap_supervisor_age_ms(now, priv->secondary_tick);
  priv->status.transport_age_ms =
    bk7258_ap_supervisor_age_ms(now, priv->transport_tick);

  if (priv->status.primary_age_ms >= timeout)
    {
      bk7258_ap_supervisor_fault_locked(
        priv, BK7258_AP_SUPERVISOR_REASON_PRIMARY_TIMEOUT,
        -ETIMEDOUT, fault, cpu2);
      return;
    }

  if (priv->status.secondary_age_ms >= timeout)
    {
      bk7258_ap_supervisor_fault_locked(
        priv, BK7258_AP_SUPERVISOR_REASON_SECONDARY_TIMEOUT,
        -ETIMEDOUT, fault, cpu2);
      return;
    }

  if (priv->status.transport_age_ms >= timeout)
    {
      bk7258_ap_supervisor_fault_locked(
        priv, BK7258_AP_SUPERVISOR_REASON_RPMSG_TIMEOUT,
        priv->status.last_error < 0 ?
        priv->status.last_error : -ETIMEDOUT, fault, cpu2);
      return;
    }

  if (priv->status.primary_age_ms >= suspect)
    {
      reason = BK7258_AP_SUPERVISOR_REASON_PRIMARY_TIMEOUT;
    }
  else if (priv->status.secondary_age_ms >= suspect)
    {
      reason = BK7258_AP_SUPERVISOR_REASON_SECONDARY_TIMEOUT;
    }
  else if (priv->status.transport_age_ms >= suspect)
    {
      reason = BK7258_AP_SUPERVISOR_REASON_RPMSG_TIMEOUT;
    }

  if (reason != BK7258_AP_SUPERVISOR_REASON_NONE)
    {
      priv->status.state = BK7258_AP_SUPERVISOR_SUSPECT;
      priv->status.reason = reason;
      priv->healthy_tick = 0;
      priv->status.healthy_age_ms = 0;
    }
  else if ((priv->status.flags &
            (BK7258_AP_SUPERVISOR_FLAG_PRIMARY |
             BK7258_AP_SUPERVISOR_FLAG_SECONDARY |
             BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK)) ==
           (BK7258_AP_SUPERVISOR_FLAG_PRIMARY |
            BK7258_AP_SUPERVISOR_FLAG_SECONDARY |
            BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK))
    {
      priv->status.state = BK7258_AP_SUPERVISOR_HEALTHY;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
      if (priv->healthy_tick == 0)
        {
          priv->healthy_tick = now;
        }
      priv->status.healthy_age_ms =
        bk7258_ap_supervisor_age_ms(now, priv->healthy_tick);
#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
      if (priv->status.healthy_age_ms >=
          CONFIG_BK7258_AP_SUPERVISOR_STABLE_MS)
        {
          priv->status.consecutive_failures = 0;
        }
#endif
    }
  else
    {
      priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
      priv->healthy_tick = 0;
      priv->status.healthy_age_ms = 0;
    }
}

static bool bk7258_ap_supervisor_shared_valid(
  const struct bk7258_ap_boot_state_s *boot,
  const struct bk7258_cpu2_probe_state_s *cpu2,
  const struct bk7258_rptun_control_s *rptun)
{
  return boot->magic == BK7258_AP_BOOT_STATE_MAGIC &&
         boot->version == BK7258_AP_BOOT_STATE_VERSION &&
         boot->size == sizeof(*boot) && boot->generation != 0 &&
         boot->state == BK7258_AP_STATE_READY &&
         boot->error == BK7258_AP_ERROR_NONE &&
         cpu2->magic == BK7258_CPU2_PROBE_STATE_MAGIC &&
         cpu2->version == BK7258_CPU2_PROBE_STATE_VERSION &&
         cpu2->size == sizeof(*cpu2) &&
         cpu2->generation == boot->generation &&
         rptun->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         rptun->version == BK7258_RPTUN_CONTROL_VERSION &&
         rptun->size == sizeof(*rptun) &&
         rptun->generation == boot->generation &&
         (rptun->flags & (BK7258_RPTUN_FLAG_AP_RPTUN_READY |
                          BK7258_RPTUN_FLAG_AP_READY)) ==
                         (BK7258_RPTUN_FLAG_AP_RPTUN_READY |
                          BK7258_RPTUN_FLAG_AP_READY);
}

static bool bk7258_ap_supervisor_shared_snapshot(
  struct bk7258_ap_boot_state_s *boot,
  struct bk7258_cpu2_probe_state_s *cpu2,
  struct bk7258_ap_fault_state_s *fault,
  struct bk7258_rptun_control_s *rptun)
{
  volatile struct bk7258_ap_boot_state_s *shared_boot =
    bk7258_ap_boot_state();
  volatile struct bk7258_cpu2_probe_state_s *shared_cpu2 =
    bk7258_cpu2_probe_state();
  volatile struct bk7258_ap_fault_state_s *shared_fault =
    bk7258_ap_fault_state();
  volatile struct bk7258_rptun_control_s *shared_rptun =
    bk7258_rptun_control();
  uint32_t boot_generation;
  uint32_t boot_state;
  uint32_t cpu2_generation;
  uint32_t cpu2_state;
  uint32_t rptun_generation;
  uint32_t rptun_state;
  unsigned int attempt;

  for (attempt = 0u; attempt < 3u; attempt++)
    {
      boot_generation = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_boot->generation,
        __ATOMIC_ACQUIRE);
      boot_state = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_boot->state, __ATOMIC_ACQUIRE);
      cpu2_generation = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_cpu2->generation,
        __ATOMIC_ACQUIRE);
      cpu2_state = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_cpu2->state, __ATOMIC_ACQUIRE);
      rptun_generation = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_rptun->generation,
        __ATOMIC_ACQUIRE);
      rptun_state = __atomic_load_n(
        (uint32_t *)(uintptr_t)&shared_rptun->state, __ATOMIC_ACQUIRE);

      memcpy(boot, (const void *)(uintptr_t)shared_boot, sizeof(*boot));
      memcpy(cpu2, (const void *)(uintptr_t)shared_cpu2, sizeof(*cpu2));
      memcpy(fault, (const void *)(uintptr_t)shared_fault, sizeof(*fault));
      memcpy(rptun, (const void *)(uintptr_t)shared_rptun, sizeof(*rptun));
      __asm volatile ("dmb sy" ::: "memory");

      if (boot_generation == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_boot->generation,
            __ATOMIC_ACQUIRE) &&
          boot_state == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_boot->state,
            __ATOMIC_ACQUIRE) &&
          cpu2_generation == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_cpu2->generation,
            __ATOMIC_ACQUIRE) &&
          cpu2_state == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_cpu2->state,
            __ATOMIC_ACQUIRE) &&
          rptun_generation == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_rptun->generation,
            __ATOMIC_ACQUIRE) &&
          rptun_state == __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_rptun->state,
            __ATOMIC_ACQUIRE) &&
          boot->generation == boot_generation &&
          boot->state == boot_state &&
          cpu2->generation == cpu2_generation &&
          cpu2->state == cpu2_state &&
          rptun->generation == rptun_generation &&
          rptun->state == rptun_state)
        {
          return true;
        }
    }

