open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
  return false;
}

static void bk7258_ap_supervisor_invalid_locked(
  struct bk7258_ap_supervisor_s *priv, clock_t now,
  uint32_t generation, uint32_t reason, int error,
  const struct bk7258_ap_fault_state_s *fault,
  const struct bk7258_cpu2_probe_state_s *cpu2)
{
  uint32_t age;

  priv->healthy_tick = 0;
  priv->status.healthy_age_ms = 0;

  if (!priv->invalid_seen)
    {
      priv->invalid_seen = true;
      priv->invalid_tick = now;
    }

  age = bk7258_ap_supervisor_age_ms(now, priv->invalid_tick);
  priv->status.state = age >= CONFIG_BK7258_AP_SUPERVISOR_SUSPECT_MS ?
    BK7258_AP_SUPERVISOR_SUSPECT : BK7258_AP_SUPERVISOR_ARMING;
  priv->status.reason = age >= CONFIG_BK7258_AP_SUPERVISOR_SUSPECT_MS ?
    reason : BK7258_AP_SUPERVISOR_REASON_NONE;

  if (age >= CONFIG_BK7258_AP_SUPERVISOR_TIMEOUT_MS)
    {
      if (!priv->armed)
        {
          priv->status.generation = generation;
        }

      bk7258_ap_supervisor_fault_locked(
        priv, reason, error, fault, cpu2);
    }
}

static void bk7258_ap_supervisor_stale_locked(
  struct bk7258_ap_supervisor_s *priv)
{
  priv->healthy_tick = 0;
  priv->status.healthy_age_ms = 0;
  priv->status.flags &= ~(BK7258_AP_SUPERVISOR_FLAG_PRIMARY |
                          BK7258_AP_SUPERVISOR_FLAG_SECONDARY |
                          BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK);
  if (priv->status.state != BK7258_AP_SUPERVISOR_FAULTED &&
      priv->status.state != BK7258_AP_SUPERVISOR_LOCKOUT &&
      priv->status.state != BK7258_AP_SUPERVISOR_RECOVERING)
    {
      priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
    }
}

static bool bk7258_ap_supervisor_monitor(void)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  struct bk7258_rpmsg_health_result_s probe;
  struct bk7258_ap_boot_state_s boot;
  struct bk7258_cpu2_probe_state_s cpu2;
  struct bk7258_ap_fault_state_s fault;
  struct bk7258_rptun_control_s rptun;
  volatile struct bk7258_rptun_control_s *shared_rptun =
    bk7258_rptun_control();
  clock_t now = clock_systime_ticks();
  bool do_probe = false;
  bool boot_header_valid;
  bool coherent;
  bool transport_active;
  bool valid;
  uint32_t probe_generation;
  int ret;

  coherent = bk7258_ap_supervisor_shared_snapshot(
               &boot, &cpu2, &fault, &rptun);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return false;
    }

  if (priv->recovering || priv->lifecycle)
    {
      nxmutex_unlock(&priv->lock);
      return true;
    }

  boot_header_valid = coherent &&
    boot.magic == BK7258_AP_BOOT_STATE_MAGIC &&
    boot.version == BK7258_AP_BOOT_STATE_VERSION &&
    boot.size == sizeof(boot) && boot.generation != 0;

  if (boot_header_valid &&
      (boot.state == BK7258_AP_STATE_OFF ||
       boot.state == BK7258_AP_STATE_STOPPED))
    {
      bk7258_ap_supervisor_set_offline_locked(priv, boot.generation);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  /* An all-zero record is the normal pre-start state only while the
   * supervisor has never armed.  If a running generation loses its header,
   * classify it as corrupt shared state instead of silently falling back to
   * OFFLINE.
   */

  if (coherent && boot.magic == 0 && !priv->armed && !priv->ready_seen)
    {
      bk7258_ap_supervisor_set_offline_locked(priv, 0);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  if (!boot_header_valid)
    {
      bk7258_ap_supervisor_invalid_locked(
        priv, now, boot.generation,
        BK7258_AP_SUPERVISOR_REASON_BAD_SHARED_STATE,
        -EPROTO, &fault, &cpu2);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  if (boot.state == BK7258_AP_STATE_FAILED)
    {
      priv->status.generation = boot.generation;
      bk7258_ap_supervisor_fault_locked(
        priv,
        (fault.magic == BK7258_AP_FAULT_STATE_MAGIC &&
         fault.generation == boot.generation && fault.exception != 0) ?
        BK7258_AP_SUPERVISOR_REASON_AP_EXCEPTION :
        BK7258_AP_SUPERVISOR_REASON_AP_REPORTED_FAILURE,
        boot.error == 0 ? -EIO : -(int)boot.error, &fault, &cpu2);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  /* A confirmed fault remains fail-closed until a new generation appears or
   * recovery is explicitly requested.  Do not let later live shared counters
   * downgrade FAULTED to SUSPECT.
   */

  if (priv->status.generation == boot.generation &&
      (priv->status.state == BK7258_AP_SUPERVISOR_FAULTED ||
       priv->status.state == BK7258_AP_SUPERVISOR_LOCKOUT))
    {
      nxmutex_unlock(&priv->lock);
      return true;
    }

  /* AP startup can legitimately spend tens of seconds in the preserved N8
   * validation gates.  Its existing start deadline owns that phase; N10 arms
   * only after AP READY, avoiding a false crash during cold boot.
   */

  if (boot.state != BK7258_AP_STATE_READY)
    {
      if (priv->armed && priv->status.generation == boot.generation)
        {
          bk7258_ap_supervisor_invalid_locked(
            priv, now, boot.generation,
            BK7258_AP_SUPERVISOR_REASON_BAD_SHARED_STATE,
            -EPROTO, &fault, &cpu2);
        }
      else
        {
          bk7258_ap_supervisor_disarm_locked(
            priv, boot.generation, BK7258_AP_SUPERVISOR_ARMING);
        }

      nxmutex_unlock(&priv->lock);
      return true;
    }

  if (!priv->ready_seen || priv->status.generation != boot.generation)
    {
      priv->ready_seen = true;
      priv->ready_tick = now;
      priv->armed = false;
      priv->invalid_seen = false;
      priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
      priv->status.generation = boot.generation;
      priv->healthy_tick = 0;
      priv->status.healthy_age_ms = 0;
    }

  /* QUIESCING is a CP-authored lifecycle transition.  Disarm while apctl
   * stops/restarts the AP so the ordinary stop path cannot be misclassified
   * as an RPTUN crash before it publishes STOPPED or a new generation.
   */

  if (rptun.magic == BK7258_RPTUN_CONTROL_MAGIC &&
      rptun.version == BK7258_RPTUN_CONTROL_VERSION &&
      rptun.size == sizeof(rptun) &&
      rptun.generation == boot.generation &&
      rptun.state == BK7258_RPTUN_STATE_QUIESCING)
    {
      bk7258_ap_supervisor_disarm_locked(
        priv, boot.generation, BK7258_AP_SUPERVISOR_ARMING);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  valid = coherent &&
          bk7258_ap_supervisor_shared_valid(&boot, &cpu2, &rptun);
  if (!valid ||
      cpu2.state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      rptun.state != BK7258_RPTUN_STATE_CONNECTED)
    {
      uint32_t reason;
      int error;

