open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
      if (!valid)
        {
          reason = BK7258_AP_SUPERVISOR_REASON_BAD_SHARED_STATE;
          error = -EPROTO;
        }
      else if (cpu2.state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE)
        {
          reason = cpu2.state == BK7258_CPU2_PROBE_STATE_FAILED ?
            BK7258_AP_SUPERVISOR_REASON_AP_REPORTED_FAILURE :
            BK7258_AP_SUPERVISOR_REASON_SECONDARY_TIMEOUT;
          error = cpu2.error == 0 ? -EHOSTDOWN : -(int)cpu2.error;
        }
      else
        {
          reason = BK7258_AP_SUPERVISOR_REASON_RPTUN_DISCONNECTED;
          error = rptun.error == 0 ? -ENOTCONN : -(int)rptun.error;
        }

      if (!priv->armed && !priv->invalid_seen)
        {
          priv->invalid_seen = true;
          priv->invalid_tick = priv->ready_tick;
        }

      bk7258_ap_supervisor_invalid_locked(
        priv, now, boot.generation, reason, error, &fault, &cpu2);
      nxmutex_unlock(&priv->lock);
      return true;
    }

  priv->invalid_seen = false;

  if (!priv->armed || priv->status.generation != boot.generation)
    {
      bk7258_ap_supervisor_arm_locked(priv, &boot, &cpu2, &rptun, now);
    }

  shared_rptun->cp_epoch = boot.generation;
  __atomic_fetch_add(
    (uint32_t *)(uintptr_t)&shared_rptun->cp_heartbeat, 1u,
    __ATOMIC_RELEASE);

  priv->status.primary_heartbeat = boot.heartbeat;
  priv->status.secondary_heartbeat = cpu2.heartbeat;
  if (boot.heartbeat != priv->last_primary)
    {
      priv->last_primary = boot.heartbeat;
      if (!bk7258_ap_supervisor_injects(
            priv, BK7258_AP_SUPERVISOR_INJECT_PRIMARY))
        {
          priv->primary_tick = now;
          priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_PRIMARY;
        }
    }

  if (cpu2.heartbeat != priv->last_secondary)
    {
      priv->last_secondary = cpu2.heartbeat;
      if (!bk7258_ap_supervisor_injects(
            priv, BK7258_AP_SUPERVISOR_INJECT_SECONDARY))
        {
          priv->secondary_tick = now;
          priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_SECONDARY;
        }
    }

  if (bk7258_rpmsg_health_ready())
    {
      priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_RPMSG_READY;
      transport_active =
        bk7258_ap_supervisor_transport_activity_locked(
          priv, shared_rptun, now);
    }
  else
    {
      priv->status.flags &= ~(BK7258_AP_SUPERVISOR_FLAG_RPMSG_READY |
                              BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK);
      transport_active = false;
    }

  if (bk7258_ap_supervisor_injects(
        priv, BK7258_AP_SUPERVISOR_INJECT_RPMSG))
    {
      priv->status.last_error = -ETIMEDOUT;
    }
  else if ((priv->status.flags &
            BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK) == 0 ||
           (clock_t)(now - priv->last_probe_tick) >=
             MSEC2TICK(CONFIG_BK7258_AP_HEALTH_PROBE_INTERVAL_MS))
    {
      priv->last_probe_tick = now;
      do_probe = true;
    }

  bk7258_ap_supervisor_evaluate_locked(priv, now, &fault, &cpu2);
  nxmutex_unlock(&priv->lock);

  if (!do_probe)
    {
      return true;
    }

  memset(&probe, 0, sizeof(probe));
  probe_generation = boot.generation;
  ret = bk7258_rpmsg_health_probe(
          probe_generation, CONFIG_BK7258_AP_HEALTH_PROBE_TIMEOUT_MS,
          &probe);
  coherent = bk7258_ap_supervisor_shared_snapshot(
               &boot, &cpu2, &fault, &rptun);
  now = clock_systime_ticks();
  if (!coherent)
    {
      if (nxmutex_lock(&priv->lock) >= 0)
        {
          bk7258_ap_supervisor_stale_locked(priv);
          nxmutex_unlock(&priv->lock);
          return true;
        }
      return false;
    }

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return false;
    }

  if (!priv->recovering && !priv->lifecycle && priv->armed &&
      priv->status.generation == probe_generation &&
      boot.generation == probe_generation &&
      bk7258_ap_supervisor_shared_valid(&boot, &cpu2, &rptun) &&
      cpu2.state == BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE &&
      rptun.state == BK7258_RPTUN_STATE_CONNECTED &&
      priv->status.state != BK7258_AP_SUPERVISOR_FAULTED &&
      priv->status.state != BK7258_AP_SUPERVISOR_LOCKOUT)
    {
      transport_active =
        bk7258_ap_supervisor_transport_activity_locked(
          priv, shared_rptun, now);
      if (bk7258_ap_supervisor_injects(
            priv, BK7258_AP_SUPERVISOR_INJECT_RPMSG))
        {
          priv->status.last_error = -ETIMEDOUT;
        }
      else if (ret >= 0 && probe.generation == probe_generation)
        {
          if (!transport_active)
            {
              priv->transport_tick = now;
              priv->status.transport_sequence = probe.sequence;
              priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_RPMSG_READY |
                                    BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK;
            }

          priv->status.last_error = 0;
          priv->last_cp_rx = __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_rptun->cp_rx_sequence,
            __ATOMIC_ACQUIRE);
          priv->last_ap_rx = __atomic_load_n(
            (uint32_t *)(uintptr_t)&shared_rptun->ap_rx_sequence,
            __ATOMIC_ACQUIRE);
          priv->transport_activity = 0;
        }
      else if (!transport_active)
        {
          /* Application traffic completing in both directions while the
           * best-effort probe is pending is stronger evidence than a
           * transient probe allocation timeout.  Only record the probe
           * error when no such traffic was observed.
           */

          priv->status.last_error = ret < 0 ? ret : -ESTALE;
        }

      bk7258_ap_supervisor_evaluate_locked(priv, now, &fault, &cpu2);
    }
  else
    {
      bk7258_ap_supervisor_stale_locked(priv);
    }

  nxmutex_unlock(&priv->lock);
  return true;
}

static int bk7258_ap_supervisor_recover_internal(uint32_t timeout_ms,
                                                 bool manual)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

