open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
  if (!priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -EAGAIN;
    }

  if (priv->recovering)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  if (priv->lifecycle)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  if (!manual && priv->status.state == BK7258_AP_SUPERVISOR_LOCKOUT)
    {
      nxmutex_unlock(&priv->lock);
      return -ECANCELED;
    }

  if (manual &&
      priv->status.state != BK7258_AP_SUPERVISOR_FAULTED &&
      priv->status.state != BK7258_AP_SUPERVISOR_SUSPECT &&
      priv->status.state != BK7258_AP_SUPERVISOR_LOCKOUT)
    {
      nxmutex_unlock(&priv->lock);
      return -EALREADY;
    }

  priv->recovering = true;
  priv->auto_recover_pending = false;
  priv->status.injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
  priv->status.flags &= ~BK7258_AP_SUPERVISOR_FLAG_INJECTED;
  priv->status.state = BK7258_AP_SUPERVISOR_RECOVERING;
  priv->healthy_tick = 0;
  priv->status.healthy_age_ms = 0;
  nxmutex_unlock(&priv->lock);

  ret = bk7258_ap_restart(timeout_ms);

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return ret;
    }

  priv->recovering = false;
  priv->armed = false;
  priv->ready_seen = false;
  priv->invalid_seen = false;
  priv->healthy_tick = 0;
  priv->status.healthy_age_ms = 0;
  if (ret >= 0)
    {
      priv->status.recovery_count++;
      priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
      priv->status.last_error = 0;
      if (manual)
        {
          priv->status.consecutive_failures = 0;
        }
    }
  else
    {
      priv->status.state = BK7258_AP_SUPERVISOR_FAULTED;
      priv->status.reason = BK7258_AP_SUPERVISOR_REASON_RECOVERY_FAILED;
      priv->status.last_error = ret;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

static int bk7258_ap_supervisor_worker(int argc, char *argv[])
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;

  (void)argc;
  (void)argv;
  for (;;)
    {
      bool recover = false;
      bool sampled;

      sampled = bk7258_ap_supervisor_monitor();
      if (nxmutex_lock(&priv->lock) >= 0)
        {
#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
          recover = priv->auto_recover_pending && !priv->recovering;
          priv->auto_recover_pending = false;
#endif
          if (sampled)
            {
              priv->sample_tick = clock_systime_ticks();
              if (++priv->status.sample_sequence == 0u)
                {
                  priv->status.sample_sequence++;
                }
            }
          nxmutex_unlock(&priv->lock);
        }

#ifdef CONFIG_BK7258_AP_SUPERVISOR_AUTO_RECOVER
      if (recover)
        {
          (void)bk7258_ap_supervisor_recover_internal(
            BK7258_AP_DEFAULT_TIMEOUT_MS, false);
        }
#else
      (void)recover;
#endif
      nxsig_usleep((unsigned int)CONFIG_BK7258_AP_SUPERVISOR_POLL_MS *
                   1000u);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_ap_supervisor_initialize(void)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  bk7258_ap_supervisor_status_initialize(priv);
  priv->status.sample_age_ms = UINT32_MAX;
  priv->initialized = true;
  priv->worker = kthread_create(
    BK7258_AP_SUPERVISOR_NAME, CONFIG_BK7258_AP_SUPERVISOR_PRIORITY,
    CONFIG_BK7258_AP_SUPERVISOR_STACKSIZE,
    bk7258_ap_supervisor_worker, NULL);
  if (priv->worker < 0)
    {
      ret = priv->worker;
      priv->initialized = false;
      priv->worker = INVALID_PROCESS_ID;
    }
  else
    {
      ret = OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_ap_supervisor_get_status(
  struct bk7258_ap_supervisor_status_s *status)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  int ret;

  if (status == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      ret = -EAGAIN;
    }
  else
    {
      clock_t now = clock_systime_ticks();

      memcpy(status, &priv->status, sizeof(*status));
      status->sample_age_ms = priv->sample_tick == 0 ? UINT32_MAX :
        bk7258_ap_supervisor_age_ms(now, priv->sample_tick);
      ret = OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_ap_supervisor_health_token(
  uint32_t expected_generation, uint32_t max_age_ms,
  struct bk7258_ap_supervisor_health_token_s *token)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  const uint32_t required = BK7258_AP_SUPERVISOR_FLAG_ARMED |
                            BK7258_AP_SUPERVISOR_FLAG_PRIMARY |
                            BK7258_AP_SUPERVISOR_FLAG_SECONDARY |
                            BK7258_AP_SUPERVISOR_FLAG_RPMSG_READY |
                            BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK;
  uint32_t sample_age;
  clock_t now;
  int ret;

  if (max_age_ms == 0u || token == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  now = clock_systime_ticks();
  sample_age = priv->sample_tick == 0 ? UINT32_MAX :
    bk7258_ap_supervisor_age_ms(now, priv->sample_tick);
  if (!priv->initialized || priv->worker < 0 ||
      priv->status.generation == 0u)
    {
      ret = -EAGAIN;
    }
  else if (expected_generation != 0u &&
           priv->status.generation != expected_generation)
    {
      ret = -ESTALE;
    }
  else if (priv->status.state != BK7258_AP_SUPERVISOR_HEALTHY ||
           (priv->status.flags & required) != required ||
           sample_age > max_age_ms)
    {
      ret = -EAGAIN;
    }
  else
    {
      token->generation = priv->status.generation;
      token->sample_sequence = priv->status.sample_sequence;
      token->flags = priv->status.flags;
      token->healthy_age_ms = priv->status.healthy_age_ms;
      token->sample_age_ms = sample_age;
      ret = OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

