open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_supervisor.c
int bk7258_ap_supervisor_recover(uint32_t timeout_ms)
{
  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_DEFAULT_TIMEOUT_MS;
    }

  return bk7258_ap_supervisor_recover_internal(timeout_ms, true);
}

void bk7258_ap_supervisor_lifecycle_begin(void)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return;
    }

  if (priv->initialized)
    {
      priv->lifecycle = true;
      if (!priv->recovering &&
          priv->status.state != BK7258_AP_SUPERVISOR_FAULTED &&
          priv->status.state != BK7258_AP_SUPERVISOR_LOCKOUT)
        {
          bk7258_ap_supervisor_disarm_locked(
            priv, priv->status.generation,
            BK7258_AP_SUPERVISOR_ARMING);
        }
    }

  nxmutex_unlock(&priv->lock);
}

void bk7258_ap_supervisor_lifecycle_end(void)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return;
    }

  priv->lifecycle = false;
  priv->invalid_seen = false;
  nxmutex_unlock(&priv->lock);
}

#ifdef CONFIG_BK7258_AP_SUPERVISOR_FAULT_INJECTION
int bk7258_ap_supervisor_inject(uint32_t injection)
{
  struct bk7258_ap_supervisor_s *priv = &g_bk7258_ap_supervisor;
  volatile struct bk7258_ap_boot_state_s *boot =
    bk7258_ap_boot_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  clock_t now = clock_systime_ticks();
  int ret;

  if (injection > BK7258_AP_SUPERVISOR_INJECT_RPMSG)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      ret = -EAGAIN;
    }
  else if (priv->recovering ||
           priv->status.state == BK7258_AP_SUPERVISOR_FAULTED ||
           priv->status.state == BK7258_AP_SUPERVISOR_LOCKOUT)
    {
      ret = -EBUSY;
    }
  else if (injection == BK7258_AP_SUPERVISOR_INJECT_NONE)
    {
      if (priv->status.injection == BK7258_AP_SUPERVISOR_INJECT_NONE)
        {
          ret = -EALREADY;
        }
      else
        {
          __asm volatile ("dmb sy" ::: "memory");
          priv->last_primary = boot->heartbeat;
          priv->last_secondary = cpu2->heartbeat;
          priv->primary_tick = now;
          priv->secondary_tick = now;
          priv->transport_tick = now;
          priv->last_probe_tick = now;
          priv->status.injection = BK7258_AP_SUPERVISOR_INJECT_NONE;
          priv->status.flags &=
            ~(BK7258_AP_SUPERVISOR_FLAG_INJECTED |
              BK7258_AP_SUPERVISOR_FLAG_PRIMARY |
              BK7258_AP_SUPERVISOR_FLAG_SECONDARY |
              BK7258_AP_SUPERVISOR_FLAG_RPMSG_OK);
          priv->status.state = BK7258_AP_SUPERVISOR_ARMING;
          priv->status.reason = BK7258_AP_SUPERVISOR_REASON_NONE;
          priv->status.last_error = 0;
          priv->healthy_tick = 0;
          priv->status.healthy_age_ms = 0;
          ret = OK;
        }
    }
  else if (priv->status.state != BK7258_AP_SUPERVISOR_HEALTHY ||
           priv->status.injection != BK7258_AP_SUPERVISOR_INJECT_NONE)
    {
      ret = -EAGAIN;
    }
  else
    {
      priv->status.injection = injection;
      priv->status.flags |= BK7258_AP_SUPERVISOR_FLAG_INJECTED;
      if (injection == BK7258_AP_SUPERVISOR_INJECT_PRIMARY)
        {
          priv->primary_tick = now;
        }
      else if (injection == BK7258_AP_SUPERVISOR_INJECT_SECONDARY)
        {
          priv->secondary_tick = now;
        }
      else
        {
          priv->transport_tick = now;
        }

      ret = OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_AP_SUPERVISOR */
